PorousMedia/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*|
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  7                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default          steadyState;
}

gradSchemes
{
    default          Gauss linear;
    grad(U)          cellMDLimited leastSquares 1;
}

divSchemes
{
    default         none;
    div(phi,U)       bounded Gauss linearUpwind limited;
    div(phi,omega)   bounded Gauss limitedLinear 1;
    div(phi,k)       bounded Gauss limitedLinear 1;
    div(phi,epsilon) bounded Gauss limitedLinear 1;
    div(phi,nuTilda) bounded Gauss limitedLinear 1;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default          Gauss linear corrected;
}

interpolationSchemes
{
    default          linear;
}

snGradSchemes
{
    default          corrected;
}

fluxRequired
{
}


wallDist
{
    method           meshWave;
}

// ************************************************************************* //